#!/usr/bin/python
# -*- coding: utf-8 -*-

DB_HOST = "127.0.0.1"
DB_USER = "admin"
DB_PASS = "uLLJ850R!"
DB_NAME = "mw_bot_db"


hello_message = "Здравствуйте. Я бот из группы Life Models. \n" \
                "Через меня вы можете опубликовать предложение или тур в группе. \n" \
                "Чтобы опубликовать предложение или тур вам необходимо пригласить несколько человек в группу. \n" \
                "Что хотите сделать? \n\n" \
                "Поддержка @LifeModelsSupportBot"

deal_msg = "Опубликовать предложение"
tour_msg = "Опубликовать тур"
balance = "Баланс"
faq = "Вопросы и ответы"
in_chat = "В чат"

msg_get_balance = "Ваш баланс составляет: "
msg_invited = " приглашенных."
btn_yes_post = "Да"
btn_no_post = "Нет"
btn_yes_tour = btn_yes_post
btn_no_tour = btn_no_post
returned = "Вернуться"
back_to_chat_btn = "Для возврата в чат нажмите на кнопку"

msg_cost_3 = "Стоимость публикации предложения - 5 приглашенных участников в группу. "
msg_cost_5 = "Стоимость публикации тура - 5 приглашенных участников в группу. "

msg_on_balance = " На вашем балансе всего "
msg_not_enough_for_post = " приглашенный(-ых) человек(-а), их не хватает для публикации "
offer = "предложения."
tour = "тура."
msg_enter_text = "Введите текст для поста: "

offer_success = "Предложение успешно опубликовано!"
tour_success = "Тур успешно опубликован!"

subscribe_msg = "Подписка"
buy_subscribe = "Купить подписку"
check_subscribe = "Проверка подписки"

post_warning = "⬆⬆⬆⬆⬆⬆⬆⬆⬆⬆⬆⬆\n\n🗺 ✈\nХочешь опубликовать предложение или тур?\n\n" \
                                      "📎📎📎\nСмотри закрепленное сообщение!\n\n⬆⬆⬆⬆⬆⬆⬆⬆⬆⬆⬆⬆"
#"Публицация осуществляется через бота. Для получения возможности публикации необходимо пригласить:\n" \
#               "5 человка за 1 предложение;\n" \
#               "5 человек за 1 тур.\n" \
#               "Приглашенными считаются люди, добавленные через кнопку \"Добавить участника\" в профиле группы."
post_btn = "Опубликовать предложение или тур"

accept_public = "Подтверждаете публикацию?"

get_subscribe_question = "Оформить подписку за 30 приглашенных?"
success_subscribe = "Подписка успешно оформлена!"
