#!/usr/bin/python
# -*- coding: utf-8 -*-

hello_message = "! " \
                "В нашем чате действует система по приглашению друзей. Чтобы начать писать в чат, " \
                "ты должен пригласить 3-х знакомых. Бот проследит за твоими приглашениями и автоматически " \
                "выдаст доступ к отправке сообщений в чат, как только ты пригласишь троих знакомых в группу."
warning_message = ", Ты еще не пригласил 3-x человек в чат. Доступ к отправке сообщений заблокирован!"

count_access_message = 3

DB_HOST = "127.0.0.1"
DB_USER = "admin"
DB_PASS = "uLLJ850R"
DB_NAME = "mw_bot_db"