#!/usr/bin/python
# -*- coding: utf-8 -*-

DB_HOST = "127.0.0.1"
DB_USER = "admin"
DB_PASS = "uLLJ850R"
DB_NAME = "mw_bot_db"


hello_message = "Здравствуйте. Я бот из группы Life Models. " \
                "Через меня вы можете опубликовать предложение или тур в группе. " \
                "Чтобы опубликовать предложение или тур вам необходимо пригласить несколько человек в группу. " \
                "Что хотите сделать?"

deal_msg = "Опубликовать предложение"
tour_msg = "Опубликовать тур"
balance = "Баланс"
faq = "Вопросы и ответы"
in_chat = "В чат"

msg_get_balance = "Ваш баланс составляет: "
msg_invited = " приглашенных."
returned = "Вернуться"
back_to_chat_btn = "Для возврата в чат нажмите на кнопку"

msg_cost_3 = "Стоимость публикации предложения - 3 приглашенных участников в группу. "
msg_cost_5 = "Стоимость публикации тура - 5 приглашенных участников в группу. "

msg_on_balance = " На вашем балансе всего "
msg_not_enough_for_post = " приглашенный(-ых) человек(-а), их не хватает для публикации "
offer = "предложения."
tour = "тура."
msg_enter_text = "Введите текст для поста: "

offer_success = "Предложение успешно опубликовано!"
tour_success = "Тур успешно опубликован!"

post_warning = "Публицация осуществляется через бота. Для получения возможности публикации необходимо пригласить:\n" \
               "3 человка за 1 предложение;\n" \
               "5 человек за 1 тур.\n" \
               "Приглашенными считаются люди, добавленные через кнопку \"Добавить участника\" в профиле группы."
post_btn = "Опубликовать предложение или тур"
